argandas/STM32F746G-DISCO_TouchGFX_Demo-1/Core/Src/main.cpp
#define THINGSPEAK_TOK_CHANNEL_ID   "channel_id"
#define THINGSPEAK_TOK_ENTRY_ID     "entry_id"
#define THINGSPEAK_TOK_FIELD1       "field1"
#define THINGSPEAK_TOK_CREATED_AT   "created_at"

BaseType_t parse_thingspeak_rsp(char* src, uint16_t len)
{
  BaseType_t xStatus;

  uint32_t ulTokenIndex;
  uint32_t ulNumTokens;
  int32_t lNumTokens;

  char* TokenStart;
  uint32_t TokenLen;

  jsmn_parser xJSMNParser;
  jsmntok_t pxTok[JSMN_MAX_TOK]; /* We expect no more than 128 tokens */

  jsmn_init(&xJSMNParser);

  lNumTokens = jsmn_parse(&xJSMNParser, src, len, pxTok, JSMN_MAX_TOK);

  if (lNumTokens < 0) 
  {
    DBG_JSMN("Failed to parse JSON (num = %d)", lNumTokens);
    xStatus = pdFAIL;
  }

  if(xStatus == pdPASS)
  {
    ulNumTokens = (uint32_t)lNumTokens;

    /* Assume the top-level element is an object */
    if (pxTok[0].type != JSMN_OBJECT) 
    {
      DBG_JSMN("Object expected (type = %d)", pxTok[0].type);
      xStatus = pdFAIL;
    }

    if(xStatus == pdPASS)
    {
      /* Loop over all keys of the root object */
      for (ulTokenIndex = 1; ulTokenIndex < lNumTokens; ulTokenIndex++)
      {

        TokenStart = &src[ pxTok[ ulTokenIndex + (uint32_t)1].start ];
        TokenLen = pxTok[ulTokenIndex+1].end - pxTok[ulTokenIndex+1].start;

        if (jsoneq(src, &pxTok[ulTokenIndex], THINGSPEAK_TOK_CHANNEL_ID) == pdTRUE) 
        {
          /* We may use strndup() to fetch string value */
          DBG_JSMN("%s: %.*s\r\n", 
            THINGSPEAK_TOK_CHANNEL_ID,
            pxTok[ulTokenIndex+1].end - pxTok[ulTokenIndex+1].start, 
            &src[ pxTok[ ulTokenIndex + (uint32_t)1].start ]
          );
        } 
        else if (jsoneq(src, &pxTok[ulTokenIndex], THINGSPEAK_TOK_ENTRY_ID) == pdTRUE) 
        {
          /* We may use strndup() to fetch string value */
          DBG_JSMN("%s: %.*s\r\n", 
            THINGSPEAK_TOK_ENTRY_ID,
            pxTok[ulTokenIndex+1].end - pxTok[ulTokenIndex+1].start, 
            &src[ pxTok[ ulTokenIndex + (uint32_t)1].start ]
          );
        } 
        else if (jsoneq(src, &pxTok[ulTokenIndex], THINGSPEAK_TOK_FIELD1) == pdTRUE) 
        {
          /* We may use strndup() to fetch string value */
          DBG_JSMN("%s: %.*s\r\n", 
            THINGSPEAK_TOK_FIELD1,
            pxTok[ulTokenIndex+1].end - pxTok[ulTokenIndex+1].start, 
            &src[ pxTok[ ulTokenIndex + (uint32_t)1].start ]
          );
        } 
        else if (jsoneq(src, &pxTok[ulTokenIndex], THINGSPEAK_TOK_CREATED_AT) == pdTRUE) 
        {
          /* We may use strndup() to fetch string value */
          DBG_JSMN("%s: %.*s\r\n", 
            THINGSPEAK_TOK_CREATED_AT,
            pxTok[ulTokenIndex+1].end - pxTok[ulTokenIndex+1].start, 
            &src[ pxTok[ ulTokenIndex + (uint32_t)1].start ]
          );
        }
#if 0
        else 
        {
          DBG_JSMN("Unexpected Token: %.*s\r\n",
            pxTok[ulTokenIndex+1].end - pxTok[ulTokenIndex+1].start, 
            &src[ pxTok[ ulTokenIndex + (uint32_t)1].start ]
          );
        }
#endif
      }
    }
  }

  return xStatus;
}

uint16_t cli_write(const char* src, uint16_t len)
{
  if ((src != NULL) && (len > 0))
  {
    HAL_UART_Transmit(&huart1, (uint8_t*)src, len, 100);
    // HAL_UART_Transmit(&huart6, (uint8_t*)src, len, 100);
  }
  return len;
}

FRESULT sd_get_free_clusters(FATFS* fs)
{
    FRESULT fr;
    DWORD fre_clust, fre_sect, tot_sect;

    /* Get volume information and free clusters of used drive */
    fr = f_getfree((TCHAR const*)SDPath, &fre_clust, &fs);
    if (fr == FR_OK)
    {
      /* Get total sectors and free sectors */
      tot_sect = (fs->n_fatent - 2) * fs->csize * _MAX_SS;
      fre_sect = fre_clust * fs->csize * _MAX_SS;

      /* Print the free space (assuming 512 bytes/sector) */
      cli_printf("[FatFs] Number of Free Clusters:\r\n");
      cli_printf("\t%8lu KB Used\r\n", (tot_sect - fre_sect)/1024);
      cli_printf("\t%8lu KB Available\r\n", fre_sect/1024);
      cli_printf("\t%8lu KB Total\r\n", tot_sect/1024);
    }
    else
    {
      DBG_FATFS("f_getfree (fr = %d)\r\n",  fr);
    }
    
    return fr;
}

FRESULT read_file_sector(FIL* file, void* dest, FSIZE_t len, UINT* bytesread, UINT index)
{
  FRESULT fr;

  fr = f_open(file, "index.htm", FA_READ);
  if(fr != FR_OK)
  {
    DBG_FATFS("f_open (fr = %d)\r\n",  fr);
  }
  else
  {
    fr = f_lseek(file, (index * len));
    if(fr != FR_OK)
    {
      DBG_FATFS("f_lseek (fr = %d)\r\n",  fr);
    }
    else
    {
      fr = f_read(file, dest, len, bytesread);
      if(fr != FR_OK)
      {
        DBG_FATFS("f_read (fr = %d)\r\n",  fr);
      }
    }
    
    fr = f_close(file);
    if(fr != FR_OK)
    {
      DBG_FATFS("f_close (fr = %d)\r\n",  fr);
    }
  }
  
  return fr;
}

/* Start node to be scanned (***also used as work area***) */
FRESULT sd_scan_files(char* path)
{
    FRESULT fr;
    DIR dir;
    UINT i;
    static FILINFO fno;

    fr = f_opendir(&dir, path);                       /* Open the directory */
    if (fr == FR_OK) {
        for (;;) {
            fr = f_readdir(&dir, &fno);                   /* Read a directory item */
            if (fr != FR_OK || fno.fname[0] == 0) break;  /* Break on error or end of dir */
            if (fno.fattrib & AM_DIR) {                    
                /* It is a directory */
                i = strlen(path);
                sprintf(&path[i], "\t%s (%4d bytes)", fno.fname, fno.fsize);
                fr = sd_scan_files(path);                    /* Enter the directory */
                if (fr != FR_OK) break;
                path[i] = 0;
            }
            else 
            {                                       
                /* It is a file. */
                cli_printf("\t%s  (%4d bytes)\r\n", fno.fname, fno.fsize);
            }
        }
        f_closedir(&dir);
    }

    return fr;
}

static BaseType_t jsoneq(const char *json, const jsmntok_t * const pxTok, const char *s) 
{
  BaseType_t xStatus = pdFALSE;

  uint32_t ulStringSize = (uint32_t)pxTok->end - (uint32_t)pxTok->start;

